<?php
// Основные параметры для настройки поиска по ключевым словам

/*******     ОСНОВНОЙ ФАЙЛ, СОДЕРЖАЩИЙ ПЕРЕЧЕНЬ ПУТЕЙ К ФАЙЛАМ, КОТОРЫЕ БУДУТ ИНДЕКСИРОВАТЬСЯ. Он создается при помощи   file_FINDER.php    *************/
define('PATH_FILE_NAMES_ALL_FILES', __DIR__ . '/files.txt'); // Абс. путь к файлу, в к-ром содержатся относительные пути ко всем файлам сайта (за исключением запрещенных)
// Путь потом может меняться, но конечный элемент "files.txt" ДОЛЖЕН сохраниться
define('ENCODING_RUS_WIN', 'cp1251'); // Windows-1251
$min_WORD_len = 3; // Минимальная длина слова (в символах), оставляемого в текстовом содержимом индексируемого файла. Это же - минимальная длина ключевого слова (для поиска)
$metaphone_len = 5; // Макс. число символов результата функции metaphone(). Реальная длина может быть даже больше, например, бывает, когда она равна 8
$path_DIR_name = __DIR__ .'/metaphones'; // Предварительно; потом, возможно, будет указан другой путь. Корневое имя "metaphones" ДОЛЖНО сохраниться
$delim = '|'; // Разделитель между относит. путем к файлу и его условным номером (в файле files.txt)
$predlogi_PATH = __DIR__ .'/predlogi.txt'; // Абсолютный путь к СЫРОМУ файлу с предлогами, междометиями, частицами, союзами русского языка
$predlogi_final_PATH = __DIR__ .'/predlogi_DATA.txt'; // Абсолютный путь к ОКОНЧАТЕЛЬНОМУ файлу с предлогами, междометиями, частицами, союзами русского языка
define('PATH_FILE_NAME_INDEXED_SUCCESS', __DIR__ . '/files_indexed_success.log'); // Путь к файлу, содержащему последний номер и путь успешно проиндексированного файла
define('PATH_FILE_NAMES_ERROR', __DIR__ . '/indexed_errors.log'); // Путь к файлу, содержащему номера и пути файлов, проиндексировать которые НЕ удалось
$path_FILE_name_STRING = __DIR__ . '/next_string.txt'; // В этот файл записывается номер строки (в файле files.txt), заданный клиентом. Индексирование файлов сайта пойдет, начиная с этой строки и т.д.
$enc_Arr = array('utf-8', 'cp1251'); // Массив допустимых кодировок СОДЕРЖИМОГО файлов и ИМЕН файлов, в которых будет осуществляться поиск. Вначале д.б. utf-8 (!)
$DO_working_flag_FILE = __DIR__ . '/DO_working_flag.txt'; // Если этот файл присутствует, эта программа будет продолжать индексирование, пока не закончит его полностью. Если этого файла нет, то индексирование будет остановлено на очередном файле
$JS_manage_mes = '<script>manage_message()</script>'; // Скрипт, добавляемый сразу после текстового сообщения, если нужно это сообщение (после получения клиентом) обработать функцией manage_message()

$ru_alfabet = 'абвгдежзийклмнопрстуфхцчшщъыьэюяё'; // Все буквы русского алфавита (отсортированные)

$max_keywords_LEN = 600; // Максимальное число символов для (логического выражения) ключевых слов
$reg_keywords = '/[^'. $ru_alfabet .'\sqwertyuiopasdfghjklzxcvbnm&\|\(\)]/'; // В ключевых словах (лог. выраж.) допустимы только эти символы
$links_NUM_max_output = 15; // Максимальное число ссылок, выводимых на экран после успешного поиска файлов с ключевыми словами
$file_finded_FILES_name = __DIR__ . '/finded_FILES.txt'; // Имя файла для сохранения перечня найденных имен файлов (соответствующим логическому выражению из ключевых слов)

$ru_aff_FILE_NAME = __DIR__ . '/FUZZY/ru.aff'; // Файл с окончаниями
$ru_dic_FILE_NAME = __DIR__ . '/FUZZY/ru.dic'; // Отсортированный файл-словарь русск. яз.
//$ru_dic_FILE_NAME_sorted = __DIR__ . '/FUZZY/ru_sorted.dic'; // Отсортированный файл-словарь русск. яз.
$ru_dic_FILE_NAME_saved = __DIR__ . '/FUZZY/ru_saved.dic'; // КОПИЯ Файла-словарь русск. яз. (на всякий случай). Исходный, НЕСОРТИРОВАННЫЙ
$ru_dic_indexing_info_file = __DIR__ . '/FUZZY/info.dic'; // Имя файла, где указан номер последней поиндексированной строки файла-словаря

$ru_dic_FILE_marks = __DIR__ . '/FUZZY/ru_sorted.marks'; // Файл с маркерами для файла ru.dic
/* маркеры будут формироваться с учетом разделения всех слов из словаря для слов (каждой их первой буквы) на 3 подгруппы. Например, для первой буквы "а" и массива array('к', 'т') маркеры будут:
"ак", "ал", "ат". Соответственно, будет 3 диапазона:
     ПервыеДвеБуквы <=ак;
ак<  ПервыеДвеБуквы <=ат;
     ПервыеДвеБуквы >ат */
$ru_dic_marks_levels_Arr = array('й', 'р'); // При изменении этих букв СЛЕДУЕТ ЗАНОВО отсортировать словарь (попутно, заново создастся новый файл маркеров)








